tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/brewdler"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/head-only"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/tex"
tap "homebrew/versions"
tap "homebrew/x11"
tap "justwatchcom/gopass"
tap "neovim/neovim"
tap "petere/postgresql"
tap "potatolabs/git-redate"
tap "rogual/neovim-dot-app"
tap "wallix/awless"
cask "java"
cask "xquartz"
brew "ack"
brew "arp-scan"
brew "gmp"
brew "gcc"
brew "arpack"
brew "asciidoctor"
brew "gdbm"
brew "openssl"
brew "ossp-uuid"
brew "readline"
brew "sqlite"
brew "python"
brew "asciinema"
brew "aspell"
brew "gettext"
brew "libffi"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash-completion"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "bitlbee"
brew "boost"
brew "brew-cask-completion"
brew "freetype"
brew "fontconfig"
brew "pixman"
brew "cairo"
brew "cargo-completion"
brew "cask"
brew "certbot"
brew "eigen"
brew "chruby"
brew "cloog"
brew "cmake"
brew "libtool"
brew "net-snmp"
brew "collectd"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "libtiff"
brew "djvulibre"
brew "ghostscript"
brew "djvu2pdf"
brew "docbook"
brew "docbook-xsl"
brew "docker-clean"
brew "docker-compose-completion"
brew "drip"
brew "elasticsearch"
brew "elinks"
brew "epstool"
brew "wxmac"
brew "exercism"
brew "faad2"
brew "fasd"
brew "fd"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "fftw"
brew "pcre2"
brew "fish"
brew "libogg"
brew "flac"
brew "freexl"
brew "fzf"
brew "gd"
brew "geos"
brew "libxml2"
brew "gdal"
brew "gdb"
brew "geoip"
brew "gflags"
brew "git"
brew "gl2ps"
brew "glew"
brew "glib-networking"
brew "glpk"
brew "gmp@4"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg", link: false
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gopass"
brew "sdl2"
brew "sdl2_image"
brew "gource"
brew "gperftools"
brew "gpp"
brew "gradle"
brew "jasper"
brew "graphicsmagick"
brew "graphviz"
brew "libmms"
brew "libvorbis"
brew "libsndfile"
brew "gst-plugins-bad@0.10"
brew "icu4c"
brew "harfbuzz"
brew "hicolor-icon-theme"
brew "szip"
brew "hdf5"
brew "heroku"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "ilmbase"
brew "imagemagick"
brew "isl@0.12"
brew "jbig2dec"
brew "jemalloc"
brew "jq"
brew "zookeeper", restart_service: true
brew "kafka", restart_service: true
brew "leiningen"
brew "leveldb"
brew "libcroco"
brew "libdnet"
brew "libevent"
brew "liblwgeom"
brew "libmagic"
brew "speex"
brew "theora"
brew "libshout"
brew "libsoup"
brew "libssh2"
brew "libtermkey"
brew "libuv"
brew "libvo-aacenc"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "lxsplit"
brew "lz4"
brew "lzlib"
brew "m-cli"
brew "macvim", args: ["with-override-system-vim"]
brew "mad"
brew "makedepend"
brew "mas"
brew "mit-scheme"
brew "mkcert"
brew "s-lang"
brew "most"
brew "msgpack"
brew "tokyo-cabinet"
brew "mutt"
brew "neovim"
brew "nginx"
brew "nmap"
brew "openexr"
brew "openssh"
brew "openssl@1.1"
brew "pam_yubico"
brew "pandoc"
brew "pgcli"
brew "pgweb"
brew "pinentry-mac"
brew "pipenv"
brew "plotutils"
brew "popt"
brew "sfcgal"
brew "postgis"
brew "postgresql@9.6"
brew "pstoedit"
brew "pstree"
brew "py2cairo"
brew "pygobject"
brew "pygtk"
brew "qrupdate"
brew "reattach-to-user-namespace"
brew "redis"
brew "regex-opt"
brew "riemann"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "ruby-install", args: ["HEAD"]
brew "scons"
brew "sdl"
brew "sdl_image"
brew "shared-mime-info"
brew "ssh-copy-id"
brew "stow"
brew "swig"
brew "taglib"
brew "tbb"
brew "tcpdump"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tor"
brew "torsocks"
brew "tree"
brew "two-lame"
brew "unixodbc"
brew "utf8proc"
brew "v8"
brew "vcprompt"
brew "vim", args: ["with-override-system-vi"], link: false
brew "watch"
brew "watchman"
brew "wget"
brew "xmlto"
brew "yasm"
brew "ykman"
brew "ykneomgr"
brew "youtube-dl"
brew "yubico-piv-tool"
brew "zeromq"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-lovers"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus", args: ["without-spacemacs-icon"]
brew "getantibody/tap/antibody"
brew "potatolabs/git-redate/git-redate"
brew "wallix/awless/awless"
cask "anybar"
cask "consul"
cask "emacs"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "haskell-platform"
cask "hyper"
cask "keycastr"
cask "pgadmin3"
cask "pgweb"
cask "yacreader"
cask "caskroom/fonts/font-fira-code"
