;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! flycheck)
(package! evil-collection)
(package! evil-commentary)
(package! ranger)
(package! dired-ranger)
(package! paredit)
(package! erlang)
(package! dap-mode)
(package! exunit)
(package! flycheck-credo)
(package! elixir-mode)
(package! alchemist)
(package! rust-mode)
(package! racer)
(package! flycheck-rust)
;;(package! org)
;;(package! lsp-mode)
(package! eglot)
;;(package! lsp-ui :recipe (:fetcher github :repo "emacs-lsp/lsp-ui"))
;;(package! lsp-rust)
(package! haskell-mode)
(package! flycheck-haskell)
(package! dockerfile-mode)
(package! paxedit)
(package! aggressive-indent)
(package! fill-column-indicator)
