;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! flycheck)
(package! flycheck-mix)
(package! flycheck-credo)
(package! smartparens)
(package! solaire-mode)
(package! erlang)
(package! cargo)
(package! rust-mode)
;;(package! racer)
(package! flycheck-rust)
(package! evil-commentary-mode)
;;(package! evil-collection)
(package! org)
(package! lsp-mode)
(package! lsp-ui :recipe (:host github :repo "emacs-lsp/lsp-ui"))
;;(package! lsp-rust)
(package! haskell-mode)
(package! flycheck-haskell)
(package! dockerfile-mode)
(package! paxedit)
(package! aggressive-indent)
(package! direnv)
(package! fill-column-indicator)
(package! docker-compose-mode)
(package! magit)
(package! terraform-mode)
;;(package! evil-mc)
(package! evil-multiedit)
(package! golden-ratio)
(package! dimmer)
(package! beacon)
(package! awesome-tab :recipe (:host github :repo "manateelazycat/awesome-tab"))
